# read design
read_verilog FSM_cond.v
read_verilog -lib cmos_cells.v
hierarchy -check -top FSM_cond

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

# mapping gates to cmos_cells.lib
abc -liberty cmos_cells.lib

# cleanup
clean

show

# write synthesized design
write_verilog FSM_synth.v